/*************************************************************************************/
/*         直接插入排序算法函数
/*------------------------------------------------------------------------------------
/*  作    者：vensontao
/*  版 本 号：1.0.0
/*  创建时间：2017-01-09
/*------------------------------------------------------------------------------------
/*  时间复杂度也为O(n^2), 比冒泡法和选择排序的性能要更好一些, 是稳定的排序算法
/*  基本思想是: 将一个记录插入到已经排好序的有序表中, 从而得到一个新的,记录数增1的有序表
/************************************************************************************/

#include <stdio.h>

//===================================================================================
// 直接插入排序算法：【for循环】
//===================================================================================
void Insert_Sort0(int a[], int len)
{
    int i, j, temp;
    for(i = 1; i < len; ++i)
    {
        temp = a[i];
        for(j = i-1; j >=0; --j)
        {
            if(a[j] > temp)
                a[j+1] = a[j];
            else
                break;
        }
        a[j+1] = temp;
    }
}

//===================================================================================
// 直接插入排序算法：【for循环】
//===================================================================================
void Insert_Sort1(int arr[], int len)
{
    int i, j, temp;
    for(i=1; i<len; i++) //数组分两个部分，从第二个数组元素开始
    {
        temp = arr[i];   //操作当前元素，先保存在其它变量中
        for(j=i-1; j>=0 && arr[j]>temp; j--)//从当前元素的上一个元素开始查找合适的位置，一直查找到首元素
        {
            arr[i] = arr[j];
            arr[j] = temp;
        }
    }
}

//===================================================================================
// 直接插入排序算法：【while循环】
//===================================================================================
void Insert_Sort2(int arr[], int len)
{
     int temp;
     int i,j;
     for (i=1; i<len; ++i) // 从数组中的第二个元素开始
     {
          temp = arr[i]; // 记录当前的元素
          j = i-1;
          while (j >= 0 && temp<arr[j]) // 将当前元素与之前的已经排序好的序列元素进行挨个比较
          {
              arr[j+1]=arr[j]; // 已经排序好的序列整体向后移动
              --j;
          }
          arr[j+1] = temp; // 插入当前的元素
     }
}

//===================================================================================
// 打印输出数组元素, 其中n为数组元素个数，0~n-1；
//===================================================================================
void PrintArray(int arr[], int n)
{
    int i;
    for (i = 0; i < n; i++)
    {
        printf(" %d ", arr[i]);
    }
    printf("\n");
}

//==============================================================
//    主函数入口
//--------------------------------------------------------------
int main()
{
    int i;
    int array[] = {95, 45, 15, 78, 84, 51, 24, 12};
    int n=sizeof(array)/sizeof(int);

    PrintArray(array, n);

    Insert_Sort(array, n);

    PrintArray(array, n);
}